In [1]:
import numpy as np
import pandas as pd

In [2]:
obj = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])

In [3]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [4]:
new_obj = obj.drop('c')

In [5]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [6]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [7]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index = ['Ohio', 'Colorado', 'Utah', 'New york'], columns = ['One', 'Two',
                                                                                                            'Three', 'Four'])

In [8]:
data

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New york   12   13     14    15

In [9]:
data.drop(['Colorado', 'Ohio'])

          One  Two  Three  Four
Utah        8    9     10    11
New york   12   13     14    15

In [10]:
data.drop('Two', axis = 1)

          One  Three  Four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New york   12     14    15

In [12]:
data.drop(['Two', 'Four'], axis = 'columns')

          One  Three
Ohio        0      2
Colorado    4      6
Utah        8     10
New york   12     14

In [13]:
obj.drop('c', inplace = False)

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [14]:
obj.drop('c', inplace = True)

In [15]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64